# PC конструктор
# Будет:
# 1) Выбор ценового диапазона с его последующим отображением в процентном соотношении с выбранными компонентами
# 2) Пункты и подпункты выбора со всеми характеристиками, включая цену и процент от максимальной цены
# 3) Общие характеристики параллельно сбору (нагрев, потребление энергии, мощность, бенчмарки, прочее)
# 4) Предупреждения о проблемах (нехватка чего-то, избыток энергии или несовместимость компонентов)
# 5) Выбор региона и возможность добавлять всё в корзину яндекс маркета прямо их приложения (или давать ссылки)
# Окна:
# Приветственное окно с сохранёнными конфигурациями
# Окно настроек
# Окно выбора цены (и региона, еси сразу давать ссылки на яндекс маркет)
# Окно выбора компонентов (с проблемами, характеристиками, ценовым соотношением)
# Окно характеристик ПК и списка компонентов (открывается только если нет проблем с возможностью отключения блокировки)
# Окно заказа (если был дан регион)


